import * as z from "zod";

const loginSchema = z.object({
  username: z
    .string({
      required_error: "نام کاربری الزامی می‌باشد",
      invalid_type_error: "نام کاربری باید متن باشد",
    })
    .min(3, "نام کاربری حداقل باید دارای 3 کاراکتر باشد")
    .max(30, "نام کاربری حداکثر باید دارای 30 کاراکتر باشد")
    .regex(
      /^[a-zA-Z0-9_]+$/,
      "نام کاربری فقط می‌تواند شامل حروف، اعداد و ـ باشد"
    ),

  password: z
    .string({
      required_error: "گذرواژه الزامی می‌باشد",
      invalid_type_error: "گذرواژه باید متن باشد",
    })
    .min(8, "گذرواژه حداقل باید دارای 8 کاراکتر باشد")
    .max(128, "گذرواژه حداکثر باید دارای 128 کاراکتر باشد")
    .regex(/[a-z]/, "رمز عبور حداقل یک حرف کوچک باید داشته باشد")
    .regex(/[A-Z]/, "رمز عبور حداقل یک حرف بزرگ باید داشته باشد")
    .regex(/[0-9]/, "رمز عبور حداقل یک عدد باید داشته باشد")
    .regex(
      /[^A-Za-z0-9]/,
      "رمز عبور حداقل یک کاراکتر ویژه مثل #@! باید داشته باشد"
    ),
});

// const registerShcema = z.object()

export default loginSchema;
